---
kind: method
id: M:Autodesk.Revit.DB.RenderingSettings.Dispose
source: html/f620adce-81d8-32da-7330-419af9a87948.htm
---
# Autodesk.Revit.DB.RenderingSettings.Dispose Method

Releases all resources used by the RenderingSettings

## Syntax (C#)
```csharp
public void Dispose()
```